In [1]:
import numpy as np
import pandas as pd

In [2]:
etiquetas = ['a','b','c']
datos = [10,20,30]
pd.Series(data=datos,index=etiquetas)

a    10
b    20
c    30
dtype: int64

In [3]:
array = np.arange(5,8)
etiquetas=["ventas1","ventas2","ventas3"]
serie1=pd.Series(array,etiquetas)
serie1

ventas1    5
ventas2    6
ventas3    7
dtype: int64

In [4]:
serie1["ventas3"]

np.int64(7)

In [6]:
datos2=['informatica',300,'impresoras',400]

In [7]:
pd.Series(datos2)

0    informatica
1            300
2     impresoras
3            400
dtype: object

In [8]:
serie1=pd.Series([1,2,3,4],['ventas1','ventas2','ventas3','ventas4'])
serie2=pd.Series([4,5,6],['ventas1','ventas2','ventas3'])

In [10]:
serie_suma = serie1+serie2
serie_suma

ventas1    5.0
ventas2    7.0
ventas3    9.0
ventas4    NaN
dtype: float64

In [11]:
filas=['ventas1','ventas2','ventas3']
columnas=['zona1','zona2','zona3']
datos=[[122,456,789],[234,567,890],[120,130,140]]

In [12]:
dataframe = pd.DataFrame(datos,filas, columnas)

In [13]:
dataframe.loc[['ventas1',"ventas2"]]

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890

In [14]:
dataframe[['zona1','zona3']]

         zona1  zona3
ventas1    122    789
ventas2    234    890
ventas3    120    140

In [15]:
dataframe.loc['ventas1']['zona2']

np.int64(456)

In [16]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [17]:
dataframe['VentasTotales']=dataframe['zona1']+dataframe['zona2']+dataframe['zona3']

In [33]:
dataframe

         zona1  zona2  zona3  VentasTotales
ventas1    122    456    789           1367
ventas2    234    567    890           1691
ventas3    120    130    140            390

In [34]:
#ocultar columna
dataframe.drop('VentasTotales',axis=1)

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [26]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [27]:
#eliminar columna
dataframe.drop('VentasTotales',axis=1,inplace=True)

KeyError: "['VentasTotales'] not found in axis"

In [28]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [30]:
dataframe.drop("ventas3")

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890

In [40]:
dataframe.drop("ventas3",inplace=True)

In [43]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890

In [44]:
dataframe.shape

(2, 3)

In [45]:
#Seleccion de datos con una condicion
filas='ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [46]:
columnas='zona1 zona2 zona3'.split()
columnas

['zona1', 'zona2', 'zona3']

In [47]:
datos=[[120,130,140],[210,220,230],[310,320,330]]
datos

[[120, 130, 140], [210, 220, 230], [310, 320, 330]]

In [31]:
dataframe = pd.DataFrame(datos,filas,columnas)
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [49]:
condicion = dataframe>200
dataframe[condicion]

         zona1  zona2  zona3
ventas1    NaN    NaN    NaN
ventas2  210.0  220.0  230.0
ventas3  310.0  320.0  330.0

In [32]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [51]:
condicion=dataframe['zona1']>135
dataframe[condicion]

         zona1  zona2  zona3
ventas2    210    220    230
ventas3    310    320    330

In [33]:
dataframe

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [34]:
condicion=(dataframe['zona1']>100)|(dataframe['zona1']<200)
dataframe[condicion]

         zona1  zona2  zona3
ventas1    122    456    789
ventas2    234    567    890
ventas3    120    130    140

In [35]:
dataframe[condicion][['zona2','zona3']]

         zona2  zona3
ventas1    456    789
ventas2    567    890
ventas3    130    140

In [36]:
#Modificacion de nombres de filas
filas='ventas1 ventas2 ventas3'.split()
columnas = 'zona1 zona2 zona3'.split()
datos=[[120,130,140],[210,220,230],[310,320,330]]
dataframe=pd.DataFrame(datos,filas,columnas)

In [37]:
dataframe

         zona1  zona2  zona3
ventas1    120    130    140
ventas2    210    220    230
ventas3    310    320    330

In [38]:
nuevas_filas ='dia1 dia2 dia3'.split()
nuevas_filas

['dia1', 'dia2', 'dia3']

In [39]:
dataframe['dias']=nuevas_filas
dataframe

         zona1  zona2  zona3  dias
ventas1    120    130    140  dia1
ventas2    210    220    230  dia2
ventas3    310    320    330  dia3

In [40]:
dataframe.set_index('dias')

      zona1  zona2  zona3
dias
dia1    120    130    140
dia2    210    220    230
dia3    310    320    330

In [41]:
#set de datos - dataset
diccionario = {'A':[4,5,np.nan],'B':[1,2,3],'C':[np.nan,4,np.nan]}
diccionario

{'A': [4, 5, nan], 'B': [1, 2, 3], 'C': [nan, 4, nan]}

In [42]:
dataframe=pd.DataFrame(diccionario)
dataframe

     A  B    C
0  4.0  1  NaN
1  5.0  2  4.0
2  NaN  3  NaN

In [43]:
dataframe.dropna()

     A  B    C
1  5.0  2  4.0

In [44]:
dataframe.dropna(axis=1)

   B
0  1
1  2
2  3

In [45]:
dataframe

     A  B    C
0  4.0  1  NaN
1  5.0  2  4.0
2  NaN  3  NaN

In [84]:
dataframe.fillna(value=100)

       A  B      C
0    4.0  1  100.0
1    5.0  2    4.0
2  100.0  3  100.0

In [46]:
dataframe

     A  B    C
0  4.0  1  NaN
1  5.0  2  4.0
2  NaN  3  NaN

In [85]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    2.0
C    4.0
dtype: float64

In [57]:
dataframe.fillna(value=valor_medio)

NameError: name 'valor_medio' is not defined

In [58]:
#Agrupacion de datos
diccionario1 = {'dias':['dia1','dia1','dia2','dia2','dia3'], 
                'Vendedores':['Edher','Michael','Waldir','Amaru','Yeni'],
                'Ventas':[100,200,300,400,500]}

In [59]:
dataframe1=pd.DataFrame(diccionario1)

In [60]:
dataframe1

   dias Vendedores  Ventas
0  dia1      Edher     100
1  dia1    Michael     200
2  dia2     Waldir     300
3  dia2      Amaru     400
4  dia3       Yeni     500

In [61]:
dataframe1.groupby('dias').sum()

        Vendedores  Ventas
dias
dia1  EdherMichael     300
dia2   WaldirAmaru     700
dia3          Yeni     500

In [62]:
dataframe1.groupby('dias').describe()

     Ventas
      count   mean        std    min    25%    50%    75%    max
dias
dia1    2.0  150.0  70.710678  100.0  125.0  150.0  175.0  200.0
dia2    2.0  350.0  70.710678  300.0  325.0  350.0  375.0  400.0
dia3    1.0  500.0        NaN  500.0  500.0  500.0  500.0  500.0

In [63]:
dataframe1.describe()

           Ventas
count    5.000000
mean   300.000000
std    158.113883
min    100.000000
25%    200.000000
50%    300.000000
75%    400.000000
max    500.000000

In [64]:
#Combinar 2 dataframes
diccionario = {'A':[1,2,3],'B':[4,5,6],'C':[7,8,9]}

In [65]:
dataframe1 = pd.DataFrame(diccionario)
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [66]:
diccionario2 ={'A':[11,12,13],'B':[14,15,16],'C':[17,18,19]}

In [67]:
dataframe2=pd.DataFrame(diccionario2)
dataframe2

    A   B   C
0  11  14  17
1  12  15  18
2  13  16  19

In [68]:
pd.concat([dataframe1,dataframe2])

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  11  14  17
1  12  15  18
2  13  16  19

In [69]:
pd.concat([dataframe1,dataframe2],axis=1)

   A  B  C   A   B   C
0  1  4  7  11  14  17
1  2  5  8  12  15  18
2  3  6  9  13  16  19

In [71]:
#Merge de DF
diccionario={'A':[1,2,3],'B':[4,5,6],'Clave':['c1','c2','c3']}
dataframe3=pd.DataFrame(diccionario)
dataframe3

   A  B Clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [72]:
diccionario1={'A':[11,12,13],'B':[14,15,16],'Clave':['c1','c2','c3']}
dataframe4=pd.DataFrame(diccionario1)
dataframe4

    A   B Clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [73]:
pd.merge(dataframe3,dataframe4,on='Clave')

   A_x  B_x Clave  A_y  B_y
0    1    4    c1   11   14
1    2    5    c2   12   15
2    3    6    c3   13   16

In [74]:
#JOIN
diccionario={'A':[1,2,3,4],'B':[4,5,6,7]}
dataframe1=pd.DataFrame(diccionario,index=['i1','i2','i3','i4'])
dataframe1

    A  B
i1  1  4
i2  2  5
i3  3  6
i4  4  7

In [75]:
diccionario1={'C':[11,12,13],'D':[14,15,16]}
dataframe2=pd.DataFrame(diccionario1,index=['i1','i2','i3'])
dataframe2

     C   D
i1  11  14
i2  12  15
i3  13  16

In [76]:
dataframe3=dataframe1.join(dataframe2)
dataframe3

    A  B     C     D
i1  1  4  11.0  14.0
i2  2  5  12.0  15.0
i3  3  6  13.0  16.0
i4  4  7   NaN   NaN

In [77]:
#Uso de ficheros
dataframe=pd.read_excel('E:/SENATI/PlanSesion2024-2/IV/1-MDULOS Y PAQUETES PARA ML CON PYTHON/ModulosPython/Ejemplo_excel.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'E:/SENATI/PlanSesion2024-2/IV/1-MDULOS Y PAQUETES PARA ML CON PYTHON/ModulosPython/Ejemplo_excel.xlsx'

In [78]:
dataframe

     A  B    C
0  4.0  1  NaN
1  5.0  2  4.0
2  NaN  3  NaN

In [105]:
dataframe['a'] =[20, 21, 22, 23]
dataframe

ValueError: Length of values (4) does not match length of index (3)

In [82]:
dataframe.to_excel('salida_excel.xlsx',sheet_name='Datos1')

ModuleNotFoundError: No module named 'openpyxl'